<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
    <style>
        body {
            text-align: right;
            color:dimgray;
            
        }
        h2{
            color:black;
        }
    
    </style>
       
 
</head>
<body>
   <?php
      include 'index.html';
    ?>
 
            <section >
            <h2>:مراحل اصلی زنبور داری</h2>
            <p>انتخاب مکان مناسب: انتخاب یک مکان مناسب برای قرار دادن کندوها بسیار مهم است. این مکان باید از نظر دسترسی به گل‌ها و منابع غذایی برای زنبورها مناسب باشد.

            انتخاب نژاد زنبور: برخی نژادهای زنبورها به تولید عسل بیشتری معروف‌اند و برخی دیگر ممکن است در شرایط خاصی عملکرد بهتری داشته باشند.
            
            نصب کندو: کندوهای زنبور معمولاً از چوب یا پلاستیک ساخته می‌شوند و باید به گونه‌ای نصب شوند که به زنبورها امکان دسترسی آسان به منابع غذایی را بدهند.
            
            نگهداری و مراقبت: زنبورداران برای مدیریت کندوها، باید به نیازهای زنبورها مانند تامین آب، غذا، درمان بیماری‌ها و کنترل آفات توجه کنند.
            
            جمع‌آوری عسل: در فصل برداشت، زنبورداران عسل را از کندوها جمع‌آوری می‌کنند. این کار نیاز به دقت و تجربه دارد تا زنبورها آسیب نبینند.
            
            محصولات جانبی: علاوه بر عسل، زنبورداران می‌توانند از سایر محصولات تهیه شده از زنبور مانند موم و ژل رویال نیز بهره‌برداری کنند.</p>
        </section>
        <section>
            <h2>:فواید زنبور داری</h2>
            <li><p>تولید عسل: عسل یکی از محصولات طبیعی و محبوب است که خواص زیادی دارد</p></li>
            <li><p>حفظ محیط زیست: زنبورها نقش مهمی در گرده‌افشانی گیاهان دارند که برای حفظ تنوع زیستی ضروری است</p></li>
            <li><p>درآمد زایی: زنبور داری می‌تواند منبع درآمد خوبی برای زنبورداران باشد</p></li>
        </section>
        </section>
        <section>
            <h2>:چالش‌ها</h2>
           <li><p>بیماری‌ها و آفات: زنبورها ممکن است به بیماری‌ها و آفات مختلفی مبتلا شوند که نیاز به مراقبت و درمان دارد</p></li>
           <li><p>تغییرات آب و هوایی: تغییرات آب و هوایی می‌تواند بر روی منابع غذایی زنبورها تأثیر بگذارد</p></li>
        
        </section>
        </section>

</body>
</html>